# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

x1 = float(input("Введите число на оси X для точки 1: "))
y1 = float(input("Введите число на оси Y для точки 1: "))
x2 = float(input("Введите число на оси X для точки 2: "))
y2 = float(input("Введите число на оси Y для точки 2: "))
line=(abs(x1-x2)**2+abs(y1-y2)**2)**(0.5)

print(round(line,3))

